#pragma once
// Класс с изображением Виселицы
class ManOnTheGallows
{
private:
    vector<string> imageGallows{
        {"________________\n | /          |\n |/\n |\n |\n |\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |\n |\n |\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |            |\n |            |\n |\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |           /|\n |            |\n |\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |           /|\\\n |            |\n |\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |           /|\\\n |            |\n |           /\n |\n |\n |\n_|______\n"},
        {"________________\n | /          |\n |/           O\n |           /|\\\n |            |\n |           / \\\n |\n |\n |\n_|______\n"}
    };
public:
    // Получения изображения человека на виселицы по индексу
    void getImageGallows(int index) const;
};